---
kind: method
id: M:Autodesk.Revit.DB.NavisworksExportOptions.#ctor
source: html/49a74067-e7da-903b-83ea-fe51274cbd32.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.#ctor Method

Create an instance of Navisworks Export Options set with default values.

## Syntax (C#)
```csharp
public NavisworksExportOptions()
```